kleinp/butler_main/PIC/dsPIC33E_starter.X/eeprom_emul.c
    if(addr >= DATA_EE_TOTAL_SIZE)
    {
        SetPageIllegalAddress(1);
        return(0xFFFF);
    }

    bank = addr / DATA_EE_SIZE;

    savedTBLPAG = TBLPAG;

    // Find the active page.
    for (currentPage = 0;
         (currentPage < NUM_DATA_EE_PAGES) &&
         (GetPageStatus(bank, currentPage, STATUS_CURRENT) == PAGE_NOT_CURRENT);
         currentPage++) {}

    if (currentPage == NUM_DATA_EE_PAGES)
    {
        TBLPAG = savedTBLPAG;
        SetPageCorruptStatus(1);
        return(0xFFFF);     // Error - no active page
    }

    // Point to proper TBLPAG and offset
    TBLPAG = DEE_PAGE_TBL(bank, currentPage);
    pmOffset = DEE_PAGE_OFFSET(bank, (currentPage + 1)) - 2;

    i=NUMBER_OF_INSTRUCTIONS_IN_PAGE;

    do
    {
        latch = ReadPMHigh(pmOffset);
        pmOffset -= 2;

        i--;
    }
    while((i > 0) && (latch != (addr % DATA_EE_SIZE)));

    if(!i)
    {
        SetaddrNotFound(1);
        TBLPAG = savedTBLPAG;
        return(0xFFFF);
    }

    pmOffset += 2;
    latch = ReadPMLow(pmOffset);

    TBLPAG = savedTBLPAG;
    return(latch);
}

/************************************************************************
DataEEWrite

This routine verifies the address is valid. If not, the Illegal Address
flag is set and an error code is returned. It then finds the active page.
If an active page can not be found, the Page Corrupt status bit is set
and an error code is returned. A read is performed, if the data was not
changed, the function exits. If the last location is programmed, the Pack
Skipped error flag is set (one location should always be available). The
data EE information (MSB = address, LSW = data) is programmed and
verified. If the verify fails, the Write Error flag is set. If the write
went into the last location of the page, pack is called. This function
can be called by the user.

Parameters:		Data EE address and data
Return:			Pass or fail status (0 = Pass)
Side Effects:	Data EE flags may be updated. CPU stall occurs for flash
                programming. Pack may be generated.
************************************************************************/
unsigned char DataEEWrite(unsigned int data, unsigned int addr)
{
    int savedTBLPAG;        //Context save of TBLPAG value. Current and packed page are on same page.
    int currentPage;
    int pmOffset;           //Current array (page) offset of selected element (PM 16-bit word)
    unsigned int nextLoc;
    volatile unsigned char latch;
    unsigned char dataEEFlags_sh;
    unsigned int bank;

    if(addr >= DATA_EE_TOTAL_SIZE)
    {
        SetPageIllegalAddress(1);
        return(5);
    }

    bank = addr / DATA_EE_SIZE;

    savedTBLPAG = TBLPAG;
    NVMCON = PROGRAM_WORD;

    // Find the active page.
    for (currentPage = 0;
         (currentPage < NUM_DATA_EE_PAGES) &&
         (GetPageStatus(bank, currentPage, STATUS_CURRENT) == PAGE_NOT_CURRENT);
         currentPage++) {}

    if (currentPage == NUM_DATA_EE_PAGES)
    {
        TBLPAG = savedTBLPAG;
        SetPageCorruptStatus(1);
        return(6);      // Error - no active page
    }

    // Point to proper TBLPAG and offset
    TBLPAG = DEE_PAGE_TBL(bank, currentPage);
    pmOffset = DEE_PAGE_OFFSET(bank, currentPage);

    dataEEFlags_sh = dataEEFlags.val;

    //Do not write data if it did not change
    if(DataEERead(addr) == data)
    {
        if(GetaddrNotFound() == 0) // Check if the read was successful
        {
            TBLPAG = savedTBLPAG;
            dataEEFlags.val = dataEEFlags_sh;
            return(0);
        }
    }

    dataEEFlags.val = dataEEFlags_sh;       //Restore status flags
    nextLoc = GetNextAvailCount(bank);

    if(!nextLoc)
    {
        TBLPAG = savedTBLPAG;
        SetPagePackSkipped(1);
        return(4);  //Error - Number of writes exceeds page size
    }

    pmOffset = pmOffset + nextLoc;

    WritePMLow(data, pmOffset);
    WritePMHigh((addr % DATA_EE_SIZE), pmOffset);

    UnlockWrite();

    Nop();
    Nop();

    latch = (ReadPMLow(pmOffset) & 0xFF);

    if(latch != (data & 0xFF))
    {
        TBLPAG = savedTBLPAG;
        SetPageWriteError(1);
        return(7);  //Error - RAM does not match PM
    }

    latch = (ReadPMHigh(pmOffset) & 0xFF);

    if(latch != (addr % DATA_EE_SIZE))
    {
        TBLPAG = savedTBLPAG;
        SetPageWriteError(1);
        return(7);  //Error - RAM does not match PM
    }

    pmOffset += 1;
    latch = ((ReadPMLow(pmOffset) >> 8) & 0xFF);

    if(latch != ((data >> 8) & 0xFF))
    {
        TBLPAG = savedTBLPAG;
        SetPageWriteError(1);
        return(7);  //Error - RAM does not match PM
    }

    //Pack if page is full
    if ((nextLoc + 2) == ((NUMBER_OF_INSTRUCTIONS_IN_PAGE) * 2))
    {
        PackEE(bank);
    }

    TBLPAG = savedTBLPAG;

    return(0);
}

/*******************************************************************************
 * The following functions attempt to make the EEPROM emulation easier to use
 * by having functions for writing 8, 16, and 32-bit numbers. The original
 * EEPROM emulation had addresses for every 16-bits, but since an 8-bit write is
 * introduced, there will now be an address for every 8-bit number.
 * ****************************************************************************/
unsigned char DataEERead8bit(unsigned int addr)
{
   if (addr%2 == 0)
      return((unsigned char)(DataEERead(addr/2) >> 8));
   else
      return((unsigned char)(DataEERead(addr/2) & 0xFF));
}

unsigned char DataEEWrite8bit(unsigned char data, unsigned int addr)
{
   unsigned int ee_val = DataEERead(addr/2);
   
   if (addr%2 == 0)
   {
      ee_val&=0x00FF;
      ee_val|=(unsigned int)(data) << 8;
      return(DataEEWrite(ee_val, addr/2));
   }
   else
   {
      ee_val&=0xFF00;
      ee_val|=(unsigned int)(data);
      return(DataEEWrite(ee_val, addr/2));
   }
   
   return(0);
}

unsigned int DataEERead16bit(unsigned int addr)
{
   if (addr%2 == 0)
      return(DataEERead(addr/2));
   else
      return(DataEERead8bit(addr) | DataEERead8bit(addr+1));
}

unsigned char DataEEWrite16bit(unsigned int data, unsigned int addr)
{
   unsigned char rtn;
   if (addr%2 == 0)
      return(DataEEWrite(data, addr/2));
   else
   {
      rtn = DataEEWrite8bit((unsigned char)(data >> 8), addr);
      rtn += DataEEWrite8bit((unsigned char)(data & 0xFF), addr+1);
   }
   return (rtn);
}

unsigned long DataEERead32bit(unsigned int addr)
{
   return(0);
}

unsigned char DataEEWrite32bit(unsigned long data, unsigned int addr)
{
   return(0);
}

unsigned char DataEEReadString(unsigned int len, unsigned int addr)
{
   return(0);
}

unsigned char DataEEWriteString(unsigned char *data, unsigned int len, unsigned int addr)
{
   unsigned int local_addr = addr;
   unsigned int str_len = len;
   unsigned char rtn = 0;

   // The function was called with zero length string
   if (str_len == 0)
      return(rtn);

   // If first byte is on odd 16-bit boundary, write 8-bit first
   if (addr%2 == 1)
   {
      rtn = DataEEWrite8bit(*data++, local_addr);
      local_addr++;
      str_len--;
   }
   // Write 16-bit chunks as long as possible
   while(str_len > 2)
   {
      rtn += DataEEWrite(*data++ | *data++, local_addr/2);
      local_addr+=2;
      str_len-=2;
   }
   // If we have a single byte remaining, write it
   if (str_len)
   {
      rtn += DataEEWrite8bit(*data, local_addr);
   }

   return(rtn);
}